mgo-tec/ESP32_SSD1331/src/ESP32_SSD1331.cpp
/*
  ESP32_SSD1331.cpp - for Arduino core for the ESP32 ( Use SPI library ).
  Beta version 1.6
  
The MIT License (MIT)

Copyright (c) 2017 Mgo-tec. All rights reserved.
Blog URL ---> https://www.mgo-tec.com

Permission is hereby granted, free of charge, to any person obtaining a copy
of this software and associated documentation files (the "Software"), to deal
in the Software without restriction, including without limitation the rights
to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
copies of the Software, and to permit persons to whom the Software is
furnished to do so, subject to the following conditions:

The above copyright notice and this permission notice shall be included in all
copies or substantial portions of the Software.

THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE
SOFTWARE.

SPI.h (SPI library for ESP32)
Copyright (c) 2015 Hristo Gochkov. All rights reserved.
License : LGPL 2.1
*/

#include "ESP32_SSD1331.h"

ESP32_SSD1331::ESP32_SSD1331(uint8_t sck, uint8_t miso, uint8_t mosi, uint8_t cs, uint8_t dc, uint8_t rst)
  :_sck(sck)
  , _miso(miso)
  , _mosi(mosi)
  , _cs(cs)
  , _dc(dc)
  , _rst(rst)
{}

SPIClass spi(HSPI);

//************ SSD1331 初期化 ****************************************
void ESP32_SSD1331::SSD1331_Init(){
  ESP32_SSD1331::SSD1331_Init(true, 0, 0, 0);
}

//************ SSD1331 初期化 ****************************************
void ESP32_SSD1331::SSD1331_Init(bool bl, uint8_t cs1, uint8_t cs2, uint8_t cs3){
  pinMode(_rst, OUTPUT); //RES
  pinMode(_dc, OUTPUT); //DC

  digitalWrite(_rst, HIGH);
  digitalWrite(_rst, LOW);
  delay(1);
  digitalWrite(_rst, HIGH);

  digitalWrite(_dc, HIGH);

  if(bl == false){
    spi.begin(_sck, _miso, _mosi, -1);
  }else{
    spi.begin(_sck, _miso, _mosi, _cs);
  }
  
  spi.setFrequency(7000000); //SSD1331 のSPI Clock Cycle Time 最低150ns
  spi.setDataMode(SPI_MODE3);
  spi.setHwCs(bl);
  
  if(cs1 > 0){
    pinMode(cs1, OUTPUT);
    digitalWrite(cs1, HIGH);
    digitalWrite(cs1, LOW);
  }
  if(cs2 > 0){
    pinMode(cs2, OUTPUT);
    digitalWrite(cs2, HIGH);
    digitalWrite(cs2, LOW);
  }
  if(cs3 > 0){
    pinMode(cs3, OUTPUT);
    digitalWrite(cs3, HIGH);
    digitalWrite(cs3, LOW);
  }

  CommandWrite(0xAE); //Set Display Off
  CommandWrite(0xA0); //Remap & Color Depth setting　
    CommandWrite(0b00110010); //A[7:6] = 00; 256 color. A[7:6] = 01; 65k color format
  CommandWrite(0xA1); //Set Display Start Line
    CommandWrite(0);
  CommandWrite(0xA2); //Set Display Offset
    CommandWrite(0);
  CommandWrite(0xA4); //Set Display Mode (Normal)
  CommandWrite(0xA8); //Set Multiplex Ratio
    CommandWrite(0b00111111); //15-63
  CommandWrite(0xAD); //Set Master Configration
    CommandWrite(0b10001110); //a[0]=0 Select external Vcc supply, a[0]=1 Reserved(reset)
  CommandWrite(0xB0); //Power Save Mode
    CommandWrite(0b00000000); //0x1A Enable power save mode
  CommandWrite(0xB1); //Phase 1 and 2 period adjustment
    CommandWrite(0x74);
  CommandWrite(0xB3); //Display Clock DIV
    CommandWrite(0xF0);
  CommandWrite(0x8A); //Pre Charge A
    CommandWrite(0x81);
  CommandWrite(0x8B); //Pre Charge B
    CommandWrite(0x82);
  CommandWrite(0x8C); //Pre Charge C
    CommandWrite(0x83);
  CommandWrite(0xBB); //Set Pre-charge level
    CommandWrite(0x3A);
  CommandWrite(0xBE); //Set VcomH
    CommandWrite(0x3E);
  CommandWrite(0x87); //Set Master Current Control
    CommandWrite(0x06);
  CommandWrite(0x15); //Set Column Address
    CommandWrite(0);
    CommandWrite(95);
  CommandWrite(0x75); //Set Row Address
    CommandWrite(0);
    CommandWrite(63);
  CommandWrite(0x81); //Set Contrast for Color A
    CommandWrite(255);
  CommandWrite(0x82); //Set Contrast for Color B
    CommandWrite(255);
  CommandWrite(0x83); //Set Contrast for Color C
    CommandWrite(255);

  for(int j=0; j<64; j++){ //Display Black OUT
    for(int i=0; i<96; i++){
      DataWrite(0x00);
      DataWrite(0x00);
      DataWrite(0x00);
    }
  }

  CommandWrite(0xAF); //Set Display On
  
  if(cs1 > 0){
    digitalWrite(cs1, HIGH);
  }
  if(cs2 > 0){
    digitalWrite(cs2, HIGH);
  }
  if(cs3 > 0){
    digitalWrite(cs3, HIGH);
  }
  delay(110); //ディスプレイONコマンドの後は最低100ms 必要
}
//*********** HSPI 通信送信 ***********************************
void ESP32_SSD1331::CommandWrite(uint8_t b){
  digitalWrite(_dc, LOW);//DC
  spi.write(b);
}

void ESP32_SSD1331::DataWrite(uint8_t b){
  digitalWrite(_dc, HIGH);//DC
  spi.write(b);
}

void ESP32_SSD1331::CommandWriteBytes(uint8_t *b, uint16_t n){
  digitalWrite(_dc, LOW);//DC
  spi.writeBytes(b, n);

}

void ESP32_SSD1331::DataWriteBytes(uint8_t *b, uint16_t n){
  digitalWrite(_dc, HIGH);//DC
  spi.writeBytes(b, n);
}

//***********画面明るさ********************************
void ESP32_SSD1331::Brightness(uint8_t brightness){
  CommandWrite(0x81); //Set Contrast for Color A
    CommandWrite(brightness);
  CommandWrite(0x82); //Set Contrast for Color B
    CommandWrite(brightness);
  CommandWrite(0x83); //Set Contrast for Color C
    CommandWrite(brightness);
}
//***********画面明るさフェードイン**********************
void ESP32_SSD1331::Brightness_FadeIn(uint8_t interval){
  for(int brightness = 0; brightness < 256; brightness++){
    CommandWrite(0x81); //Set Contrast for Color A
      CommandWrite(brightness);
    CommandWrite(0x82); //Set Contrast for Color B
      CommandWrite(brightness);
    CommandWrite(0x83); //Set Contrast for Color C
      CommandWrite(brightness);
    delay(interval);
  }
}
//***********画面明るさフェードアウト********************
void ESP32_SSD1331::Brightness_FadeOut(uint8_t interval){
  for(int brightness = 255; brightness >= 0; brightness--){
    CommandWrite(0x81); //Set Contrast for Color A
      CommandWrite(brightness);
    CommandWrite(0x82); //Set Contrast for Color B
      CommandWrite(brightness);
    CommandWrite(0x83); //Set Contrast for Color C
      CommandWrite(brightness);
    delay(interval);
  }
}
//***********ディスプレイ消去***************************
void ESP32_SSD1331::Display_Clear(uint8_t cs, uint8_t x0, uint8_t y0, uint8_t x1, uint8_t y1){
  spi.setFrequency(7000000); //SSD1331 のSPI Clock Cycle Time 最低150ns
  spi.setDataMode(SPI_MODE3);
  //spi.setHwCs(bl);
  digitalWrite(cs, LOW);
  ESP32_SSD1331::Display_Clear(x0, y0, x1, y1);
  digitalWrite(cs, HIGH);
}

//***********ディスプレイ消去***************************
void ESP32_SSD1331::Display_Clear(uint8_t x0, uint8_t y0, uint8_t x1, uint8_t y1){
  //delayMicroseconds(500); //クリアーコマンドは400μs 以上の休止期間が必要かも
  delay(1);
  CommandWrite(0x25); //Clear Window
    CommandWrite(x0); //Column Address of Start
    CommandWrite(y0); //Row Address of Start
    CommandWrite(x1); //Column Address of End
    CommandWrite(y1); //Row Address of End
  //delayMicroseconds(800); //ここの間隔は各自調節してください。
  delay(1);
}
//********** 範囲コピー *********************************
void ESP32_SSD1331::SSD1331_Copy(uint8_t x0, uint8_t y0, uint8_t x1, uint8_t y1, uint8_t X, uint8_t Y){
  uint8_t buf[7];
  buf[0] = 0x23; //Copy Command
  buf[1] = x0; buf[2] = y0; buf[3] = x1; buf[4] = y1; buf[5] = X; buf[6] = Y; 

  //delayMicroseconds(500);
  delay(1);
  CommandWriteBytes(buf, sizeof(buf)); 
  //delayMicroseconds(500);
  delay(1);
}
//********* OLED 8x16フォント出力 ********************
void ESP32_SSD1331::SSD1331_8x16_Font_DisplayOut(uint8_t cs, uint8_t txtMax, uint8_t x0, uint8_t y0, uint8_t red, uint8_t green, uint8_t blue, uint8_t Fnt[][16]){
  digitalWrite(cs, LOW);
  ESP32_SSD1331::SSD1331_8x16_Font_DisplayOut(txtMax, x0, y0, red, green, blue, Fnt);
  digitalWrite(cs, HIGH);
}
//********* OLED 8x16フォント出力 ********************
void ESP32_SSD1331::SSD1331_8x16_Font_DisplayOut(uint8_t txtMax, uint8_t x0, uint8_t y0, uint8_t red, uint8_t green, uint8_t blue, uint8_t Fnt[][16]){
  uint8_t com[6];
  spi.setFrequency(7000000); //SSD1331 のSPI Clock Cycle Time 最低150ns
  spi.setDataMode(SPI_MODE3);
  //spi.setHwCs(true);
  
  if( txtMax > 12) txtMax = 12;
  com[0] = 0x15; //Set Column Address
    com[1] = x0;
    com[2] = x0 + (8*txtMax) - 1;
  com[3] = 0x75; //Set Row Address
    com[4] = y0;
    com[5] = y0 + 15;

  CommandWriteBytes(com, sizeof(com));

  int i, j, k;
  uint8_t bt = 0b10000000;

  uint8_t Dot = (red << 5) | (green << 2) | blue;

  uint8_t dummy[16*txtMax*8];
  uint16_t cnt = 0;

  for(i=0; i<16; i++){
    for(j=0; j<txtMax; j++){
      bt = 0b10000000;
      for(k=0; k<8; k++){
        if(k>0){
          bt = bt >> 1;
        }
        if( (Fnt[j][i] & bt) ){
          dummy[cnt] = Dot;
        }else{
          dummy[cnt] = 0;
        }
        cnt++;
      }
    }
  }

