mgo-tec/ESP32_SSD1331/src/ESP32_SSD1331.cpp
  DataWriteBytes(dummy, (16 * txtMax * 8));
}
//********* OLED 8x16フォント　サイズアップ　出力 ********************
void ESP32_SSD1331::SizeUp_8x16_Font_DisplayOut(uint8_t Size, uint8_t txtMax, uint8_t x0, uint8_t y0, uint8_t red, uint8_t green, uint8_t blue, uint8_t Fnt[][16]){
  ESP32_SSD1331::HVsizeUp_8x16_Font_DisplayOut(Size, Size, txtMax, x0, y0, red, green, blue, Fnt);
}
//********* OLED 8x16フォント　サイズアップ　出力 ********************
void ESP32_SSD1331::HVsizeUp_8x16_Font_DisplayOut(uint8_t H_Size, uint8_t V_Size, uint8_t txtMax, uint8_t x0, uint8_t y0, uint8_t red, uint8_t green, uint8_t blue, uint8_t Fnt[][16]){
  uint8_t com[6];
  spi.setFrequency(7000000); //SSD1331 のSPI Clock Cycle Time 最低150ns
  spi.setDataMode(SPI_MODE3);
  //spi.setHwCs(true);
  
  if( txtMax > 12) txtMax = 12;
  
  if(H_Size == 4){
    txtMax = 3;
  }else if(H_Size == 2){
    txtMax = 6;
  }
  uint8_t txtmax_sizeup = txtMax * (8 * H_Size);
  
  com[0] = 0x15; //Set Column Address
    com[1] = x0;
    //com[2] = 95;
    com[2] = x0 + txtmax_sizeup - 1;
  com[3] = 0x75; //Set Row Address
    com[4] = y0;
    com[5] = y0 + (16*V_Size)-1;
    //com[5] = 63;

  CommandWriteBytes(com, 6);

  int i, j, k, ii;
  uint8_t bt = 0b10000000;

  uint8_t Dot = (red << 5) | (green << 2) | blue;
  
  uint8_t dummy[16*V_Size][96] = {};
  
  uint16_t cnt = 0;

  uint8_t size_cnt=0;
  for(i=0; i<16; i++){

      for(j=0; j<txtMax; j++){
        bt = 0b10000000;
        for(k=0; k<8; k++){
          if(k>0){
            bt = bt >> 1;
          }
          if( (Fnt[j][i] & bt) ){
            for(ii=0; ii<H_Size; ii++){
              dummy[i][cnt++] = Dot;
            }
          }else{
            cnt = cnt + H_Size;
          }
        }
      }
      cnt = 0;

  }
  //digitalWrite(_dc, LOW);//DC

  for(i=0; i<16; i++){
    for(size_cnt=0; size_cnt<V_Size; size_cnt++){
      DataWriteBytes(dummy[i], (txtmax_sizeup));
      //spi.writeBytes(dummy[i], (txtmax_sizeup));
    }
  }
}
//********* OLED 8x8フォント出力 ********************
void ESP32_SSD1331::SSD1331_8x8_Font_DisplayOut(uint8_t txtMax, uint8_t x0, uint8_t y0, uint8_t red, uint8_t green, uint8_t blue, uint8_t Fnt[][8]){
  uint8_t com[6];
  spi.setFrequency(7000000); //SSD1331 のSPI Clock Cycle Time 最低150ns
  spi.setDataMode(SPI_MODE3);
  //spi.setHwCs(true);

  if( txtMax > 12) txtMax = 12;
  com[0] = 0x15; //Set Column Address
    com[1] = x0;
    com[2] = x0 + (8*txtMax) - 1;
  com[3] = 0x75; //Set Row Address
    com[4] = y0;
    com[5] = y0 + 7;

  CommandWriteBytes(com, sizeof(com));

  int i, j, k;
  uint8_t bt = 0b10000000;

  uint8_t Dot = (red << 5) | (green << 2) | blue;

  uint8_t dummy[8*txtMax*8];
  uint16_t cnt = 0;

  for(i=0; i<8; i++){
    for(j=0; j<txtMax; j++){
      bt = 0b10000000;
      for(k=0; k<8; k++){
        if(k>0){
          bt = bt >> 1;
        }
        if((Fnt[j][i] & bt)>0){
          dummy[cnt] = Dot;
        }else{
          dummy[cnt] = 0;
        }
        cnt++;
      }
    }
  }

  DataWriteBytes(dummy, (8 * txtMax * 8));
}
//*********** 時刻垂直スクロール ****************
void ESP32_SSD1331::Time_Copy_V_Scroll(uint8_t Direction, uint8_t ZorH, uint8_t buf[2][16], uint8_t *SclCnt, uint8_t x0, uint8_t y0, uint8_t x1, uint8_t y1, uint8_t col_R, uint8_t col_G, uint8_t col_B){
  ESP32_SSD1331::SizeUp_Copy_V_Scroll(Direction, ZorH, buf, *SclCnt, x0, y0, x1, y1, col_R, col_G, col_B);
  (*SclCnt)++;
}
//*********** 時刻水平スクロール **********************
void ESP32_SSD1331::Time_Copy_H_Scroll(uint8_t Direction, uint8_t ZorH, uint8_t buf[2][16], uint8_t *SclCnt, uint8_t x0, uint8_t y0, uint8_t x1, uint8_t y1, uint8_t col_R, uint8_t col_G, uint8_t col_B){
  uint8_t com[6];
  uint8_t Dot = (col_R << 5) | (col_G << 2) | col_B;
  uint8_t i;
  uint8_t k = 0;
  uint8_t bbb = 0;

  switch( Direction ){
    case 0:
      SSD1331_Copy(x0+1, y0, x1, y1, x0, y0);

      com[0] = 0x15; //Set Column Address
        com[1] = x1; com[2] = x1;
      com[3] = 0x75; //Set Row Address
        com[4] = y0; com[5] = y1;

      if((*SclCnt) < 8){
        bbb = 0b10000000 >> (*SclCnt);
      }else if((*SclCnt) >= 8){
        bbb = 0b10000000 >> ((*SclCnt)-8);
      }

      if((*SclCnt) < 8){
        k = 0;
      }else{
        k = 1;
      }

      break;
    case 1:
      SSD1331_Copy(x0, y0, x1-1, y1, x0+1, y0);

      com[0] = 0x15; //Set Column Address
        com[1] = x0; com[2] = x0;
      com[3] = 0x75; //Set Row Address
        com[4] = y0; com[5] = y1;

      if((*SclCnt) < 8){
        bbb = 0b00000001 << (*SclCnt);
      }else if((*SclCnt) >= 8){
        bbb = 0b00000001 << ((*SclCnt) - 8);
      }

      if(ZorH == 2){
        if((*SclCnt) < 8){
          k = 1;
        }else{
          k = 0;
        }
      }else if(ZorH ==1){
        k = 0;
      }

      break;
  }

  CommandWriteBytes(com, 6);  

  uint8_t DotDot[16];

  for(i=0; i<16; i++){
    if((buf[k][i] & bbb) > 0){
      DotDot[i] = Dot;
    }else{
      DotDot[i] = 0;
    }
  }

  DataWriteBytes(DotDot, 16);
  (*SclCnt)++;
}
//************ 256色カラー 1ピクセル 描画 *****************
void ESP32_SSD1331::Drawing_Pixel_256color(uint8_t x0, uint8_t y0, uint8_t R, uint8_t G, uint8_t B){
  uint8_t com[6];
  //R (0-7), G (0-7), B (0-3)
  com[0] = 0x15; //Set Column Address
    com[1] = x0;
    com[2] = x0;
  com[3] = 0x75; //Set Row Address
    com[4] = y0;
    com[5] = y0;

  CommandWriteBytes(com, 6);

  uint8_t Dot = (R << 5) | (G << 2) | B;

  DataWrite(Dot);
}
//************ 65000色カラー 1ピクセル 描画 *****************
void ESP32_SSD1331::Drawing_Pixel_65kColor(uint8_t x0, uint8_t y0, uint8_t R, uint8_t G, uint8_t B){
  uint8_t com[6];
  uint8_t DotDot[2];

  com[0] = 0x15; //Set Column Address
    com[1] = x0;
    com[2] = x0;
  com[3] = 0x75; //Set Row Address
    com[4] = y0;
    com[5] = y0;

  CommandWriteBytes(com, 6);

  DotDot[0] = (R << 3) | (G >> 3);
  DotDot[1] = (G << 5) | B;

  DataWriteBytes(DotDot, 2);
}
//************ 65000色　線　描画******************************
void ESP32_SSD1331::Drawing_Line(uint8_t X0, uint8_t Y0, uint8_t X1, uint8_t Y1, uint8_t Line_R, uint8_t Line_G, uint8_t Line_B){
  uint8_t com[8];
  //Line_R (0-31), Line_G (0-63), Line_B (0-31)
  uint8_t R, B;
  R = Line_R <<1;
  B = Line_B <<1;

  com[0] = 0x21;
    com[1] = X0;
    com[2] = Y0;
    com[3] = X1;
    com[4] = Y1;
    com[5] = R;
    com[6] = Line_G;
    com[7] = B;

