mgo-tec/ESP32_SSD1331/src/ESP32_SSD1331.cpp
  CommandWriteBytes(com, 8);
}
//************ 65000色　四角　線描画***************************
void ESP32_SSD1331::Drawing_Rectangle_Line(uint8_t X0, uint8_t Y0, uint8_t X1, uint8_t Y1, uint8_t Line_R, uint8_t Line_G, uint8_t Line_B){
  uint8_t com[13];
  //Line_R (0-31), Line_G (0-63), Line_B (0-31)
  uint8_t R, B;
  R = Line_R <<1;
  B = Line_B <<1;

  com[0] = 0x26; //Fill Enable or Disable
    com[1] = 0b00000000; //A0=1 Fill Disable

  com[2] = 0x22; //Drawing Rectangle
    com[3] = X0; //Column Address of Start
    com[4] = Y0; //Row Address of Start
    com[5] = X1; //Column Address of End
    com[6] = Y1; //Row Address of End
    com[7] = R;
    com[8] = Line_G;
    com[9] = B;
    com[10] = 0;
    com[11] = 0;
    com[12] = 0;

  CommandWriteBytes(com, 13);
}
//************ 65000色　四角　塗りつぶし描画***************************
void ESP32_SSD1331::Drawing_Rectangle_Fill(uint8_t X0, uint8_t Y0, uint8_t X1, uint8_t Y1, uint8_t Line_R, uint8_t Line_G, uint8_t Line_B, uint8_t Fill_R, uint8_t Fill_G, uint8_t Fill_B){
  uint8_t com[13];
  //Line_R (0-31), Line_G (0-63), Line_B (0-31)
  //Fill_R (0-31), Fill_G (0-63), Fill_B (0-31)
  uint8_t lineR, lineB, fillR, fillB;
  lineR = Line_R <<1;
  lineB = Line_B <<1;
  fillR = Fill_R <<1;
  fillB = Fill_B <<1;

  com[0] = 0x26; //Fill Enable or Disable
    com[1] = 0b00000001; //A0=0 Fill Enable

  com[2] = 0x22; //Drawing Rectangle
    com[3] = X0; //Column Address of Start
    com[4] = Y0; //Row Address of Start
    com[5] = X1; //Column Address of End
    com[6] = Y1; //Row Address of End
    com[7] = lineR;
    com[8] = Line_G;
    com[9] = lineB;
    com[10] = fillR;
    com[11] = Fill_G;
    com[12] = fillB;

  CommandWriteBytes(com, 13);
}
//************* 256色カラー　円 線描画***********************
void ESP32_SSD1331::Drawing_Circle_Line_256color(uint8_t x0, uint8_t y0, uint16_t r, uint8_t Line_R, uint8_t Line_G, uint8_t Line_B){
  uint8_t com[6];
  //Line_R (0-7), Line_G (0-7), Line_B (0-3)
  uint8_t x1, y1;

  for(int i=0; i<360; i++){
    x1 = round((float)(x0 + (r * cos(radians(i)))));
    y1 = round((float)(y0 + (r * sin(radians(i)))));
    Drawing_Pixel_256color(x1, y1, Line_R, Line_G, Line_B);
  }
  delay(1);
  //描画範囲を元に戻して置く
  com[0] = 0x15; //Set Column Address
    com[1] = 0;
    com[2] = 95;
  com[3] = 0x75; //Set Row Address
    com[4] = 0;
    com[5] = 63;

  CommandWriteBytes(com, 6);
}
//************* 65000色カラー　円 線描画***********************
void ESP32_SSD1331::Drawing_Circle_Line_65kColor(uint8_t x0, uint8_t y0, uint16_t r, uint8_t Line_R, uint8_t Line_G, uint8_t Line_B){
  uint8_t com[8];
  uint8_t x1, y1;

  CommandWrite(0xA0); //Remap & Color Depth setting　
    CommandWrite(0b01110010); //A[7:6] = 00; 256 color. A[7:6] = 01; 65k color format

  for(int i=0; i<360; i++){
    x1 = round((float)(x0 + (r * cos(radians(i)))));
    y1 = round((float)(y0 + (r * sin(radians(i)))));
    Drawing_Pixel_65kColor(x1, y1, Line_R, Line_G, Line_B);
  }
  delay(1);
  //描画範囲を元に戻して置く
  com[0] = 0xA0; //Remap & Color Depth setting　
    com[1] = 0b00110010; //A[7:6] = 00; 256 color. A[7:6] = 01; 65k color format

  com[2] = 0x15; //Set Column Address
    com[3] = 0;
    com[4] = 95;
  com[5] = 0x75; //Set Row Address
    com[6] = 0;
    com[7] = 63;

  CommandWriteBytes(com, 8);
}
//************* 65000色カラー　円塗りつぶし描画*****************
void ESP32_SSD1331::Drawing_Circle_Fill(uint8_t x0, uint8_t y0, uint16_t r, uint8_t Line_R, uint8_t Line_G, uint8_t Line_B){
  //Line_R (0-31), Line_G (0-63), Line_B (0-31)
  uint8_t R, B;
  R = Line_R <<1;
  B = Line_B <<1;

  uint8_t x1, y1;

  for(int i=0; i<360; i++){
    x1 = round((float)(x0 + (r * cos(radians(i)))));
    y1 = round((float)(y0 + (r * sin(radians(i)))));
    Drawing_Line(x0, y1, x1, y1, R, Line_G, B);
  }
}
//*********電光掲示板風スクロール 8x16ドット********************
bool ESP32_SSD1331::Scroller_8x16_RtoL(uint8_t y0, uint8_t Zen_or_Han, uint8_t fnt_buf[16], uint8_t* scl_cnt1, uint8_t *ZorH_cnt, uint8_t col_R, uint8_t col_G, uint8_t col_B){

  Copy_Scroll(y0, fnt_buf, *scl_cnt1, col_R, col_G, col_B);

  (*scl_cnt1)++;

  if(*scl_cnt1 == 8){
    *scl_cnt1 = 0;
    if(Zen_or_Han == 2){
      if(*ZorH_cnt == 0){
        *ZorH_cnt = 1;
        return false;
      }else{
        *ZorH_cnt = 0;
        return true;
      }
    }else{
      *ZorH_cnt = 0;
      return true;
    }
  }

  return false;
}
//********************************************************
bool ESP32_SSD1331::Scroller_8x16_RtoL4line(uint8_t CS_pin, uint8_t y0, uint8_t num, uint8_t Zen_or_Han, uint8_t *SclCnt, uint8_t *ZorHcnt, uint8_t fnt_buf[][16], uint8_t col_R, uint8_t col_G, uint8_t col_B){
  spi.setFrequency(7000000); //SSD1331 のSPI Clock Cycle Time 最低150ns
  spi.setDataMode(SPI_MODE3);
  //spi.setHwCs(bl);
  
  bool ret;

  digitalWrite(CS_pin, LOW);
  ret = ESP32_SSD1331::Scroller_8x16_RtoL4line(y0, num, Zen_or_Han, SclCnt, ZorHcnt, fnt_buf, col_R, col_G, col_B);
  digitalWrite(CS_pin, HIGH);

  return ret;
}

//********************************************************
bool ESP32_SSD1331::Scroller_8x16_RtoL4line(uint8_t y0, uint8_t num, uint8_t Zen_or_Han, uint8_t *SclCnt, uint8_t *ZorHcnt, uint8_t fnt_buf[][16], uint8_t col_R, uint8_t col_G, uint8_t col_B){
  Copy_Scroll(y0, fnt_buf[*ZorHcnt], *SclCnt, col_R, col_G, col_B);

  *SclCnt = *SclCnt + 1;

  if(*SclCnt == 8){
    *SclCnt = 0;
    if(Zen_or_Han == 2){
      if(*ZorHcnt == 0){
        *ZorHcnt = 1;
        return false;
      }else{
        *ZorHcnt = 0;
        return true;
      }
    }else{
      *ZorHcnt = 0;
      return true;
    }
  }

  return false;
}
//*********電光掲示板風スクロール 8x16ドット********************
bool ESP32_SSD1331::Scroller_8x16_RtoL4line(uint8_t y0, uint8_t num, uint8_t Zen_or_Han, uint8_t fnt_buf[][16], uint8_t col_R, uint8_t col_G, uint8_t col_B){
  return ESP32_SSD1331::HVsizeUp_Scroller_8x16_RtoL(1, 1, 0, 95, y0, num, Zen_or_Han, fnt_buf, col_R, col_G, col_B);
}
//*********電光掲示板風スクロール 8x16ドット サイズアップ********************
bool ESP32_SSD1331::SizeUp_Scroller_8x16_RtoL(uint8_t Size, uint8_t y0, uint8_t num, uint8_t Zen_or_Han, uint8_t fnt_buf[][16], uint8_t col_R, uint8_t col_G, uint8_t col_B){
  return ESP32_SSD1331::HVsizeUp_Scroller_8x16_RtoL(Size, Size, 0, 95, y0, num, Zen_or_Han, fnt_buf, col_R, col_G, col_B);
}
//*********電光掲示板風スクロール 8x16ドット 全角サイズアップ********************
bool ESP32_SSD1331::SizeUp_Scroller_8x16_RtoL(uint8_t Size, uint8_t x0, uint8_t x1, uint8_t y0, uint8_t num, uint8_t Zen_or_Han, uint8_t fnt_buf[][16], uint8_t col_R, uint8_t col_G, uint8_t col_B){
  return ESP32_SSD1331::HVsizeUp_Scroller_8x16_RtoL(Size, Size, x0, x1, y0, num, Zen_or_Han, fnt_buf, col_R, col_G, col_B);
}
//*********電光掲示板風スクロール 8x16ドット 縦、横サイズアップ********************
bool ESP32_SSD1331::HVsizeUp_Scroller_8x16_RtoL(uint8_t H_Size, uint8_t V_Size, uint8_t x0, uint8_t x1, uint8_t y0, uint8_t num, uint8_t Zen_or_Han, uint8_t fnt_buf[][16], uint8_t col_R, uint8_t col_G, uint8_t col_B){
  for(int i=0; i<H_Size; i++){
    ESP32_SSD1331::SizeUp_Copy_Scroll(V_Size, x0, x1, y0, fnt_buf[_ZorH_cnt[num]], _scl_cnt[num], col_R, col_G, col_B);
  }
  _scl_cnt[num]++;

  if(_scl_cnt[num] == 8){
    _scl_cnt[num] = 0;
    if(Zen_or_Han == 2){
      if(_ZorH_cnt[num] == 0){
        _ZorH_cnt[num] = 1;
        return false;
      }else{
        _ZorH_cnt[num] = 0;
        return true;
      }
    }else{
      _ZorH_cnt[num] = 0;
      return true;
    }
  }

