mgo-tec/ESP32_SSD1331/src/ESP32_SSD1331.cpp
  return false;
}

//***************************
void ESP32_SSD1331::SizeUp_Copy_Scroll(uint8_t Size, uint8_t y0, uint8_t buf[16], uint8_t scl_cnt2, uint8_t col_R, uint8_t col_G, uint8_t col_B){
  ESP32_SSD1331::SizeUp_Copy_Scroll(Size, 0, 95, y0, buf, scl_cnt2, col_R, col_G, col_B);
}
//***************************
void ESP32_SSD1331::SizeUp_Copy_Scroll(uint8_t Size, uint8_t x0, uint8_t x1, uint8_t y0, uint8_t buf[16], uint8_t scl_cnt2, uint8_t col_R, uint8_t col_G, uint8_t col_B){
  if(Size > 4) Size = 4;
  uint8_t Dot = (col_R << 5) | (col_G << 2) | col_B;

  uint8_t y1 = y0 + 16*Size - 1;
  SSD1331_Copy(x0+1, y0, x1, y1, x0, y0);

  uint8_t com[6];
  com[0] = 0x15; //Set Column Address
    com[1] = x1;
    com[2] = x1;
  com[3] = 0x75; //Set Row Address
    com[4] = y0;
    com[5] = y1;

  CommandWriteBytes(com, 6);

  uint8_t bbb = 0b10000000 >> scl_cnt2;
  
  uint8_t max_size = 16*Size;

  uint8_t DotDot[max_size];

  uint8_t Dot_write_cnt = 0;
  uint8_t font_read_cnt = 0;
  uint8_t i;
  
  for(font_read_cnt=0; font_read_cnt<16; font_read_cnt++){
    if( (buf[font_read_cnt] & bbb) ){
      for(i=0; i<Size; i++){
        DotDot[Dot_write_cnt++] = Dot;
      }
    }else{
      for(i=0; i<Size; i++){
        DotDot[Dot_write_cnt++] = 0;
      }
    }
  }

  DataWriteBytes(DotDot, max_size);
}

//***************************
void ESP32_SSD1331::Copy_Scroll(uint8_t y0, uint8_t buf[16], uint8_t scl_cnt2, uint8_t col_R, uint8_t col_G, uint8_t col_B){
  ESP32_SSD1331::SizeUp_Copy_Scroll(1, 0, 95, y0, buf, scl_cnt2, col_R, col_G, col_B);
}
//*********電光掲示板風スクロール 16x16ドット 縦、横サイズアップ、縦方向スクロール********************
bool ESP32_SSD1331::HVsizeUp_Vscroller_16x16(uint8_t H_Size, uint8_t V_Size, uint8_t Direction, uint8_t x0, uint8_t y0, uint8_t y1, uint8_t num, uint8_t Zen_or_Han, uint8_t fnt_buf[][16], uint8_t col_R, uint8_t col_G, uint8_t col_B){
  uint8_t x1 = x0 + 16*H_Size - 1;
  for(int i=0; i<V_Size; i++){
    ESP32_SSD1331::SizeUp_Copy_V_Scroll(Direction, Zen_or_Han, fnt_buf, _scl_cnt[num], x0, y0, x1, y1, col_R, col_G, col_B);
  }
  _scl_cnt[num]++;

  if(_scl_cnt[num] == 16){
    _scl_cnt[num] = 0;
    return true;
  }

  return false;
}
//*********** 垂直スクロール ****************
void ESP32_SSD1331::SizeUp_Copy_V_Scroll(uint8_t Direction, uint8_t ZorH, uint8_t buf[2][16], uint8_t SclCnt, uint8_t x0, uint8_t y0, uint8_t x1, uint8_t y1, uint8_t col_R, uint8_t col_G, uint8_t col_B){
  uint8_t Dot = (col_R << 5) | (col_G << 2) | col_B;
  uint8_t i, k;
  uint8_t bbb = 0b10000000;
  uint8_t DotDot[8 * ZorH];
  uint8_t com[6];

  switch( Direction ){
    case 0:
      SSD1331_Copy(x0, y0+1, x1, y1, x0, y0);

      com[0] = 0x15; //Set Column Address
        com[1] = x0; com[2] = x1;
      com[3] = 0x75; //Set Row Address
        com[4] = y1; com[5] = y1;
      break;
    case 1:
      SSD1331_Copy(x0, y0, x1, y1-1, x0, y0+1);

      com[0] = 0x15; //Set Column Address
        com[1] = x0; com[2] = x1;
      com[3] = 0x75; //Set Row Address
        com[4] = y0; com[5] = y0;
      break;
  }  

  CommandWriteBytes(com, sizeof(com));

  switch( Direction ){
    case 0:
      for(k=0; k<ZorH; k++){
        bbb = 0b10000000;
        for(i=0; i<8; i++){
          if(i>0) bbb = bbb >> 1;
          if( ( buf[k][SclCnt] & bbb ) ){
            DotDot[i + k*8] = Dot;
          }else{
            DotDot[i + k*8] = 0;
          }
        }
      }
      break;
    case 1:
      for(k=0; k<ZorH; k++){
        bbb = 0b10000000;
        for(i=0; i<8; i++){
          if(i>0) bbb = bbb >> 1;
          if( ( buf[k][15 - SclCnt] & bbb ) ){
            DotDot[i + k*8] = Dot;
          }else{
            DotDot[i + k*8] = 0;
          }
        }
      }
      break;
  }

  DataWriteBytes(DotDot, sizeof(DotDot));
}